Revit 2027 API
ParameterTypeId.ViewDiscipline Property
 "Discipline"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewDiscipline { get; }
Public Shared ReadOnly Property ViewDiscipline As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewDiscipline {
	ForgeTypeId^ get ();
}
static member ViewDiscipline : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace